base/DataProcessors/бит_ДоставкаОповещенийЭлектроннойПочтой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ДоставкаОповещенийЭлектроннойПочтой</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресSMTP</Name>
					<Comment>Адрес SMTP сервера.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Comment> Порт протокола SMTP</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLSMTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗащищеннаяАутентификацияSMTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMailАдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресPOP3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательPOP3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольPOP3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POPАутентификация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLPOP3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗащищеннаяАутентификацияPOP3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMailАдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>Время ожидания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3_Перед_SMTP</Name>
					<Comment>POP3 перед SMTP</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/DataProcessors/бит_ДоставкаОповещенийЭлектроннойПочтой/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, что обработка является обработкой доставки оповещений.
// 
// Возвращаемое значение:
//   Булево
// 
Функция ЭтоОбработкаДоставкиОповещений() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает настройки доставки по умолчанию.
// 
// Возвращаемое значение:
//   РезСтруктура   - Структура
// 
Функция НастройкиПоУмолчанию() Экспорт

	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("АдресSMTP",							"");	
	РезСтруктура.Вставить("ПортSMTP",							25);
	РезСтруктура.Вставить("SMTPАутентификация",					"БезАутентификации");
	РезСтруктура.Вставить("ПользовательSMTP",					"");	
	РезСтруктура.Вставить("ПарольSMTP",							"");	
	РезСтруктура.Вставить("ИспользоватьSSLSMTP",				Ложь);	
	РезСтруктура.Вставить("ТолькоЗащищеннаяАутентификацияSMTP",	Ложь);	
	РезСтруктура.Вставить("EMailАдресОтправителя",				"");	
	РезСтруктура.Вставить("АдресPOP3",							"");	
	РезСтруктура.Вставить("ПортPOP3",							110);
	РезСтруктура.Вставить("ПользовательPOP3",					"");	
	РезСтруктура.Вставить("ПарольPOP3",							"");	
	РезСтруктура.Вставить("POPАутентификация",					"Обычная");
	РезСтруктура.Вставить("ИспользоватьSSLPOP3",				Ложь);	
	РезСтруктура.Вставить("ТолькоЗащищеннаяАутентификацияPOP3", Ложь);	
	РезСтруктура.Вставить("EMailАдресПолучателя",				"");	
	РезСтруктура.Вставить("ВремяОжидания",						30);
	РезСтруктура.Вставить("POP3_Перед_SMTP",					Ложь);	
	РезСтруктура.Вставить("КодировкаСообщения",					"");	

	Возврат РезСтруктура;
	
КонецФункции // НастройкиПоУмолчанию()

// Процедура выполняет отправку сообщений;
// 
// Параметры:
//  СообщениеСтруктура  - Структура.
//  НастройкиДоставки   - Структура.
//  СтруктураПараметров - Структура.
//  ПротоколОтправки    - Строка.
// 
Функция ОтправитьСообщение(СообщениеСтруктура, НастройкиДоставки, СтруктураПараметров,ПротоколОтправки="") Экспорт
	
	флДействиеВыполнено = Ложь;			
	Отказ = Ложь;
	
	// Выполним проверки настроек 
	СтруктураСообщенияКорректна(СообщениеСтруктура,Отказ,ПротоколОтправки);	
	СтруктураПараметровКорректна(СтруктураПараметров,Отказ,ПротоколОтправки); 
	
	Если НЕ Отказ Тогда
		
		// Сформируем почтовый профиль
		ИПП 					= Новый ИнтернетПочтовыйПрофиль;
		ИПП.АдресСервераSMTP 	= НастройкиДоставки.АдресSMTP;   
		ИПП.ПортSMTP 			= НастройкиДоставки.ПортSMTP;
		Если НЕ ПустаяСтрока(СокрЛП(НастройкиДоставки.SMTPАутентификация)) Тогда			
			ИПП.АутентификацияSMTP 	= СпособSMTPАутентификации[СокрЛП(НастройкиДоставки.SMTPАутентификация)];			
		КонецЕсли; 
		ИПП.ПользовательSMTP 	= НастройкиДоставки.ПользовательSMTP;
		ИПП.ПарольSMTP 			= НастройкиДоставки.ПарольSMTP;
		Если НастройкиДоставки.Свойство("ИспользоватьSSLSMTP") Тогда			
			ИПП.ИспользоватьSSLSMTP = НастройкиДоставки.ИспользоватьSSLSMTP;			
		КонецЕсли; 
		Если НастройкиДоставки.Свойство("ТолькоЗащищеннаяАутентификацияSMTP") Тогда			
			ИПП.ТолькоЗащищеннаяАутентификацияSMTP = НастройкиДоставки.ТолькоЗащищеннаяАутентификацияSMTP;			
		КонецЕсли; 		
		
		ИПП.АдресСервераPOP3    = НастройкиДоставки.АдресPOP3;
		ИПП.ПортPOP3            = НастройкиДоставки.ПортPOP3;
		Если НЕ ПустаяСтрока(СокрЛП(НастройкиДоставки.POPАутентификация)) Тогда			
			ИПП.АутентификацияPOP3  = СпособPOP3Аутентификации[СокрЛП(НастройкиДоставки.POPАутентификация)];			
		КонецЕсли; 
		ИПП.Пользователь        = НастройкиДоставки.ПользовательPOP3;
		ИПП.Пароль              = НастройкиДоставки.ПарольPOP3;
		
		Если НастройкиДоставки.Свойство("ИспользоватьSSLPOP3") Тогда			
			ИПП.ИспользоватьSSLPOP3 = НастройкиДоставки.ИспользоватьSSLPOP3;			
		КонецЕсли; 
		Если НастройкиДоставки.Свойство("ТолькоЗащищеннаяАутентификацияPOP3") Тогда			
			ИПП.ТолькоЗащищеннаяАутентификацияPOP3 = НастройкиДоставки.ТолькоЗащищеннаяАутентификацияPOP3;			
		КонецЕсли; 		
		
		// Создадим сообщение. 
		Сообщение = Новый ИнтернетПочтовоеСообщение; 
		
		Если НастройкиДоставки.Свойство("КодировкаСообщения") Тогда
			Сообщение.Кодировка = НастройкиДоставки.КодировкаСообщения;
		КонецЕсли;
		
		Сообщение.Отправитель.Адрес = НастройкиДоставки.EMailАдресОтправителя;
		Сообщение.ОбратныйАдрес.Добавить(НастройкиДоставки.EMailАдресОтправителя);
		Сообщение.Получатели.Добавить(СтруктураПараметров.АдресПолучателя);  		
		Сообщение.Тема = СообщениеСтруктура.Заголовок; 
		Сообщение.Тексты.Добавить(СообщениеСтруктура.Текст + Символы.ПС + СообщениеСтруктура.Подпись, СообщениеСтруктура.ТипТекстаСообщения); 
		
		// Вложения.
		Если СообщениеСтруктура.ВложенияШаблона <> Неопределено Тогда
			Для Каждого Вложение Из СообщениеСтруктура.ВложенияШаблона Цикл
				НовоеВложение = Сообщение.Вложения.Добавить(Вложение.Значение.ПолучитьДвоичныеДанные(), Вложение.Ключ);
				НовоеВложение.Идентификатор = Вложение.Ключ;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Вложение Из Сообщение.Вложения Цикл
			Если Не ЗначениеЗаполнено(Вложение.ТипСодержимого) Тогда
				ТипСодержимого = ОпределитьТипСодержимогоПоИмениФайла(Вложение.Имя);
				Если ЗначениеЗаполнено(ТипСодержимого) Тогда
					Вложение.ТипСодержимого = ТипСодержимого;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Подключимся и отправим сформированное сообщение.
		Попытка			
			Почта = Новый ИнтернетПочта; 
			Почта.Подключиться(ИПП); 
			Почта.Послать(Сообщение); 
			флДействиеВыполнено = Истина;
			ПротоколОтправки = НСтр("ru = 'Сообщение отправлено по адресу %1 %2.'; 
									|en = 'Сообщение отправлено по адресу %1 %2.'");      	
			ПротоколОтправки = СтрШаблон(ПротоколОтправки, СтруктураПараметров.АдресПолучателя, ТекущаяДатаСеанса());						
		Исключение			
			флДействиеВыполнено = Ложь;
			ПротоколОтправки = НСтр("ru = 'Сообщение  не удалось отправить по адресу %1 %2 по причине %3.'; 
									|en = 'Сообщение  не удалось отправить по адресу %1 %2 по причине %3.'");
			ПротоколОтправки = СтрШаблон(ПротоколОтправки, СтруктураПараметров.АдресПолучателя, ТекущаяДатаСеанса(), 
										 ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));						
		КонецПопытки;
		
		Почта.Отключиться(); 
		
	КонецЕсли; 
	
	Возврат флДействиеВыполнено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет корретность структуры сообщения.
// 
Процедура СтруктураСообщенияКорректна(Сообщение, Отказ, ПротоколОтправки = "")
	
	// Приведем строковое описание типа текста к системному перечислению.
	Если НЕ Сообщение.Свойство("ТипТекстаСообщения")
		ИЛИ НЕ ЗначениеЗаполнено(Сообщение.ТипТекстаСообщения) Тогда
		
		ТипТекстаСообщения = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Иначе
		
		Для Каждого ТекущийТипТекста Из ТипТекстаПочтовогоСообщения Цикл
			
			Если Строка(ТекущийТипТекста) = Сообщение.ТипТекстаСообщения Тогда
				ТипТекстаСообщения = ТекущийТипТекста;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сообщение.Вставить("ТипТекстаСообщения", ТипТекстаСообщения);
	
КонецПроцедуры

// Процедура проверяет корретность структуры параметров.
// 
Процедура СтруктураПараметровКорректна(Настройка, Отказ, ПротоколОтправки = "")
	
	Если НЕ Настройка.Свойство("АдресПолучателя") ИЛИ НЕ ЗначениеЗаполнено(Настройка.АдресПолучателя) Тогда
	
		Отказ = Истина;
		ПротоколОтправки = НСтр("ru = 'Не указан адрес получателя.'; en = 'The recipient address is not specified.'");		
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ОпределитьТипСодержимогоПоИмениФайла(ИмяФайла)
	
	Расширение = "";
	Позиция = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		Расширение = НРег(Сред(ИмяФайла, Позиция + 1));
	КонецЕсли;
	
	Возврат ТипыСодержимого()[Расширение];
	
КонецФункции

Функция ТипыСодержимого()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("json", "application/json");
	Результат.Вставить("pdf", "application/pdf");
	Результат.Вставить("xhtml", "application/xhtml+xml");
	Результат.Вставить("zip", "application/zip");
	Результат.Вставить("gzip", "application/gzip");
	
	Результат.Вставить("aac", "audio/aac");
	Результат.Вставить("ogg", "audio/ogg");
	Результат.Вставить("wma", "audio/x-ms-wma");
	Результат.Вставить("wav", "audio/vnd.wave");
	
	Результат.Вставить("gif", "image/gif");
	Результат.Вставить("jpeg", "image/jpeg");
	Результат.Вставить("png", "image/png");
	Результат.Вставить("svg", "image/svg");
	Результат.Вставить("tiff", "image/tiff");
	Результат.Вставить("ico", "image/vnd.microsoft.icon");
	
	Результат.Вставить("html", "text/html");
	Результат.Вставить("txt", "text/plain");
	Результат.Вставить("xml", "text/xml");
	
	Результат.Вставить("mpeg", "video/mpeg");
	Результат.Вставить("mp4", "video/mp4");
	Результат.Вставить("mov", "video/quicktime");
	Результат.Вставить("wmv", "video/x-ms-wmv");
	Результат.Вставить("flv", "video/x-flv");
	Результат.Вставить("3gpp", "video/3gpp");
	Результат.Вставить("3gp", "video/3gpp");
	Результат.Вставить("3gpp2", "video/3gpp2");
	Результат.Вставить("3g2", "video/3gpp2");
	
	Результат.Вставить("odt", "application/vnd.oasis.opendocument.text");
	Результат.Вставить("ods", "application/vnd.oasis.opendocument.spreadsheet");
	Результат.Вставить("odp", "application/vnd.oasis.opendocument.presentation");
	Результат.Вставить("odg", "application/vnd.oasis.opendocument.graphics");
	
	Результат.Вставить("doc", "application/msword");
	Результат.Вставить("docx", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	Результат.Вставить("xls", "application/vnd.ms-excel");
	Результат.Вставить("xlsx", "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
	Результат.Вставить("ppt", "application/vnd.ms-powerpoint");
	Результат.Вставить("pptx", "application/vnd.openxmlformats-officedocument.presentationml.presentation");
	
	Результат.Вставить("rar", "application/x-rar-compressed");
	
	Результат.Вставить("p7m", "application/x-pkcs7-mime");
	Результат.Вставить("p7s", "application/x-pkcs7-signature");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
